; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v4 ?v3)
             (pred_1 ?v11 ?v5)
             (pred_2 ?v4 ?v5)
             (pred_3 ?v12 ?v4 )
	     (pred_4 ?v4)
             (pred_12 ?v10)
             (pred_10 ?v11)
             (pred_8 ?v5)
             (pred_9 ?v4)
             (pred_5 ?v11)
             (pred_6 ?v4)
             (pred_7 ))



(:action op_5
:parameters (?v9 ?v2 ?v1 ?v6)
:precondition (and (pred_12 ?v9) (pred_12 ?v2) (pred_10 ?v1) (pred_8 ?v6)
          (pred_11 ?v9 ?v2) (pred_1 ?v1 ?v6)
                   (pred_2 ?v2 ?v6) (pred_4 ?v9) 
                   (pred_9 ?v2) (pred_5 ?v1))
:effect (and  (pred_6 ?v2) (not (pred_9 ?v2))))


(:action op_1
:parameters (?v9 ?v13)
:precondition (and (pred_12 ?v9) (pred_12 ?v13)
               (pred_4 ?v9) (pred_11 ?v9 ?v13) (pred_6 ?v13))
:effect (and (pred_4 ?v13) (not (pred_4 ?v9))))

(:action op_3
:parameters (?v9 ?v1)
:precondition (and (pred_12 ?v9) (pred_10 ?v1) 
                  (pred_4 ?v9) (pred_3 ?v1 ?v9) (pred_7 ))
:effect (and (pred_5 ?v1)
   (not (pred_3 ?v1 ?v9)) (not (pred_7 ))))


(:action op_4
:parameters (?v9 ?v8 ?v7)
:precondition (and (pred_12 ?v9) (pred_10 ?v8) (pred_10 ?v7)
                  (pred_4 ?v9) (pred_5 ?v7) (pred_3 ?v8 ?v9))
:effect (and (pred_5 ?v8) (pred_3 ?v7 ?v9)
        (not (pred_5 ?v7)) (not (pred_3 ?v8 ?v9))))

(:action op_2
:parameters (?v9 ?v1)
:precondition (and (pred_12 ?v9) (pred_10 ?v1) 
                  (pred_4 ?v9) (pred_5 ?v1))
:effect (and (pred_7 ) (pred_3 ?v1 ?v9) (not (pred_5 ?v1)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_11 obj_14 obj_03 obj_17 obj_10 obj_12 obj_04 obj_18 obj_21 obj_13 obj_02 obj_22 obj_06 obj_16 obj_20 obj_19
    obj_09 obj_05 obj_01
    obj_08 obj_07 obj_15
    )

    (:init
       (pred_7)

       (pred_12 obj_11)
       (pred_12 obj_14)
       (pred_12 obj_03)
       (pred_12 obj_17)
       (pred_12 obj_10)
       (pred_12 obj_12)
       (pred_12 obj_04)
       (pred_12 obj_18)
       (pred_12 obj_21)
       (pred_12 obj_13)
       (pred_12 obj_02)
       (pred_12 obj_22)
       (pred_12 obj_06)
       (pred_12 obj_16)
       (pred_12 obj_20)
       (pred_12 obj_19)
       (pred_8 obj_09)
       (pred_8 obj_05)
       (pred_8 obj_01)
       (pred_10 obj_08)
       (pred_10 obj_07)
       (pred_10 obj_15)

       (pred_11 obj_11 obj_10)
       (pred_11 obj_11 obj_14)
       (pred_11 obj_14 obj_12)
       (pred_11 obj_14 obj_03)
       (pred_11 obj_14 obj_11)
       (pred_11 obj_03 obj_04)
       (pred_11 obj_03 obj_17)
       (pred_11 obj_03 obj_14)
       (pred_11 obj_17 obj_18)
       (pred_11 obj_17 obj_03)
       (pred_11 obj_10 obj_21)
       (pred_11 obj_10 obj_12)
       (pred_11 obj_10 obj_11)
       (pred_11 obj_12 obj_13)
       (pred_11 obj_12 obj_04)
       (pred_11 obj_12 obj_14)
       (pred_11 obj_12 obj_10)
       (pred_11 obj_04 obj_02)
       (pred_11 obj_04 obj_18)
       (pred_11 obj_04 obj_03)
       (pred_11 obj_04 obj_12)
       (pred_11 obj_18 obj_22)
       (pred_11 obj_18 obj_17)
       (pred_11 obj_18 obj_04)
       (pred_11 obj_21 obj_06)
       (pred_11 obj_21 obj_13)
       (pred_11 obj_21 obj_10)
       (pred_11 obj_13 obj_16)
       (pred_11 obj_13 obj_02)
       (pred_11 obj_13 obj_12)
       (pred_11 obj_13 obj_21)
       (pred_11 obj_02 obj_20)
       (pred_11 obj_02 obj_22)
       (pred_11 obj_02 obj_04)
       (pred_11 obj_02 obj_13)
       (pred_11 obj_22 obj_19)
       (pred_11 obj_22 obj_18)
       (pred_11 obj_22 obj_02)
       (pred_11 obj_06 obj_16)
       (pred_11 obj_06 obj_21)
       (pred_11 obj_16 obj_20)
       (pred_11 obj_16 obj_13)
       (pred_11 obj_16 obj_06)
       (pred_11 obj_20 obj_19)
       (pred_11 obj_20 obj_02)
       (pred_11 obj_20 obj_16)
       (pred_11 obj_19 obj_22)
       (pred_11 obj_19 obj_20)
       (pred_9 obj_13)
       (pred_9 obj_18)
       (pred_9 obj_02)
       (pred_2  obj_13 obj_09)
       (pred_2  obj_18 obj_05)
       (pred_2  obj_02 obj_01)
       (pred_6 obj_11)
       (pred_6 obj_14)
       (pred_6 obj_03)
       (pred_6 obj_17)
       (pred_6 obj_10)
       (pred_6 obj_12)
       (pred_6 obj_04)
       (pred_6 obj_21)
       (pred_6 obj_22)
       (pred_6 obj_06)
       (pred_6 obj_16)
       (pred_6 obj_20)
       (pred_6 obj_19)

       (pred_1  obj_08 obj_09)
       (pred_1  obj_07 obj_05)
       (pred_1  obj_15 obj_01)
       (pred_3 obj_08 obj_11)
       (pred_3 obj_07 obj_12)
       (pred_3 obj_15 obj_04)
       (pred_4 obj_03)
    )

    (:goal (and
       (pred_3 obj_15 obj_20)
    ))
(:constraints
  (always (not (pred_4 obj_02)))
)
)

; plan
1. (op_1 obj_03 obj_04)
   deleted: (pred_4 obj_03)
   added: (pred_4 obj_04)
   goals met: 0 of 1
2. (op_3 obj_04 obj_15)
   deleted: (pred_3 obj_15 obj_04) (pred_7)
   added: (pred_5 obj_15)
   goals met: 0 of 1
3. (op_1 obj_04 obj_12)
   deleted: (pred_4 obj_04)
   added: (pred_4 obj_12)
   goals met: 0 of 1
4. (op_1 obj_12 obj_10)
   deleted: (pred_4 obj_12)
   added: (pred_4 obj_10)
   goals met: 0 of 1
5. (op_1 obj_10 obj_21)
   deleted: (pred_4 obj_10)
   added: (pred_4 obj_21)
   goals met: 0 of 1
6. (op_1 obj_21 obj_06)
   deleted: (pred_4 obj_21)
   added: (pred_4 obj_06)
   goals met: 0 of 1
7. (op_1 obj_06 obj_16)
   deleted: (pred_4 obj_06)
   added: (pred_4 obj_16)
   goals met: 0 of 1
8. (op_1 obj_16 obj_20)
   deleted: (pred_4 obj_16)
   added: (pred_4 obj_20)
   goals met: 0 of 1
9. (op_2 obj_20 obj_15)
   deleted: (pred_5 obj_15)
   added: (pred_7) (pred_3 obj_15 obj_20)
   goals met: 1 of 1
